## 학습목표
 1. DataFrame이 무엇인지 이해한다. 
 2. 다양한 형태의 데이터를 DataFrame 형태로 불러올 수 있다.

### 1. DataFrame
  - 데이터프레임은 테이블형(2차원) 데이터이며, 데이터 분석/머신 러닝에서 데이터 처리를 위해 주로 사용된다.
  - 2차원이기 때문에 엑셀/csv와 같이 데이터가 row, column로 구성되며, 인덱스도 두 개, row/column 각각 존재한다.
    - 행의 레이블은 인덱스로, 열의 레이블은 컬럼으로 부른다.

In [1]:
import pandas as pd

In [2]:
df = pd.read_csv('student.csv')

In [3]:
df

    이름  나이            주소
0  오혜인  20   경기도 용인시 수지구
1  강경미  20  경기도 고양시 일산동구
2  홍길동  10   서울시 종로구 혜화동

In [4]:
df.index

RangeIndex(start=0, stop=3, step=1)

In [5]:
df.columns  #속성들의 이름 확인가능

Index(['이름', '나이', '주소'], dtype='object')

In [6]:
df.values

array([['오혜인', 20, '경기도 용인시 수지구'],
       ['강경미', 20, '경기도 고양시 일산동구'],
       ['홍길동', 10, '서울시 종로구 혜화동']], dtype=object)

In [7]:
student_df = pd.read_csv('student.txt')
student_df

    이름  나이            주소
0  강경미  30  경기도 고양시 일산동구
1  고길동  20   서울시 노원구 상계동
2  개나리  19   서울시 강남구 역삼동

In [9]:
student_df = pd.read_csv('student_tab.txt', delimiter = '\t')
student_df

    이름  나이            주소
0  강경미  30  경기도 고양시 일산동구
1  고길동  20   서울시 노원구 상계동
2  개나리  19   서울시 강남구 역삼동

In [10]:
student_df = pd.read_csv('student_data.txt', delimiter ='\t')
student_df

   강경미  30 경기도 고양시 일산동구
0  고길동  20  서울시 노원구 상계동
1  개나리  19  서울시 강남구 역삼동

In [11]:
# header가 없는 데이터의 경우 None을 쓰면 임의로 인덱스를 부여해서 리턴.
student_df = pd.read_csv('student_data.txt', delimiter ='\t', header = None)
student_df

     0   1             2
0  강경미  30  경기도 고양시 일산동구
1  고길동  20   서울시 노원구 상계동
2  개나리  19   서울시 강남구 역삼동

In [12]:
student_df.columns

Int64Index([0, 1, 2], dtype='int64')

In [13]:
student_df.columns = ['이름', '나이', '주소']
student_df

    이름  나이            주소
0  강경미  30  경기도 고양시 일산동구
1  고길동  20   서울시 노원구 상계동
2  개나리  19   서울시 강남구 역삼동

In [14]:
#header가 없는 데이터 불러올 때 컬럼명 부여해서 가져오기

student_df = pd.read_csv('student_data.txt', delimiter ='\t', header = None, names = ['이름', '나이', '주소'])
student_df

    이름  나이            주소
0  강경미  30  경기도 고양시 일산동구
1  고길동  20   서울시 노원구 상계동
2  개나리  19   서울시 강남구 역삼동

In [15]:
student_df.columns

Index(['이름', '나이', '주소'], dtype='object')

In [16]:
#리스트 / 딕셔너리로 데이터프레임 생성

student_dict_list = [
    {'name':'kang','age':30,'address':'경기도 고양시 일산동구'},
    {'name':'kim','age':23,'address':'서울시 강남구 역삼동'},
    {'name':'hong','age':22,'address':'서울시 양천구 목동'},
    {'name':'lee','age':31,'address':'서울시 영등포구 양평동'},
    {'name':'hhh','age':27,'address':'서울시 노원구 상계동'}    
                    ]

df = pd.DataFrame(student_dict_list)
df

   name  age       address
0  kang   30  경기도 고양시 일산동구
1   kim   23   서울시 강남구 역삼동
2  hong   22    서울시 양천구 목동
3   lee   31  서울시 영등포구 양평동
4   hhh   27   서울시 노원구 상계동

In [18]:
data = {'a': 100, 'b':200, 'c': 300}
pd.DataFrame(data, index = ['x', 'y', 'z'])

     a    b    c
x  100  200  300
y  100  200  300
z  100  200  300

In [19]:
data = {'a': [100, 101, 102], 'b':[200,201, 202], 'c': [300,301,302]}
pd.DataFrame(data)

     a    b    c
0  100  200  300
1  101  201  301
2  102  202  302

In [20]:
data = {'a': [100, 101, 102], 'b':[200,201, 202], 'c': [300,301,302]}
pd.DataFrame(data, index = ['x', 'y', 'z'])

     a    b    c
x  100  200  300
y  101  201  301
z  102  202  302

In [21]:
a = pd.Series([100, 200, 300], ['a', 'b', 'c'])
b = pd.Series([101, 201, 301], ['a', 'b', 'c'])
c = pd.Series([102, 202, 302], ['a', 'b', 'c'])

pd.DataFrame([a, b, c])  # 시리즈를 각각 넣어준다.

     a    b    c
0  100  200  300
1  101  201  301
2  102  202  302

In [22]:
pd.DataFrame([a, b, c], index  = [100, 200, 300])

       a    b    c
100  100  200  300
200  101  201  301
300  102  202  302

In [23]:
df = pd.DataFrame([a, b, c], index  = [100, 200, 300])
df['a']

100    100
200    101
300    102
Name: a, dtype: int64

In [24]:
df[['a', 'b']]

       a    b
100  100  200
200  101  201
300  102  202

### 데이터프레임은 index, columns, values 를 갖는다.
    
    - Series 는 index 와 values

In [25]:
a.index

Index(['a', 'b', 'c'], dtype='object')

In [26]:
a.values

array([100, 200, 300], dtype=int64)

In [27]:
df.columns

Index(['a', 'b', 'c'], dtype='object')

In [29]:
#d 인덱스로 특정컬럼 선택하기.
df = pd.DataFrame({
    "년도": [2000, 2010, 2020],    
    "미국": [2.1, 2.2, 2.3],
    "한국": [0.4, 0.5, 0.45],
    "중국": [10, 13, 15]    
})
df

     년도   미국    한국  중국
0  2000  2.1  0.40  10
1  2010  2.2  0.50  13
2  2020  2.3  0.45  15

In [30]:
# 년도로 인덱스를 하고싶을 때!
df = df.set_index('년도')
df

       미국    한국  중국
년도
2000  2.1  0.40  10
2010  2.2  0.50  13
2020  2.3  0.45  15

In [31]:
df.index

Int64Index([2000, 2010, 2020], dtype='int64', name='년도')

In [32]:
df.index.name

'년도'

In [35]:
#요렇게 수정도 가능
df.index.name = '연도'

In [36]:
df

       미국    한국  중국
연도
2000  2.1  0.40  10
2010  2.2  0.50  13
2020  2.3  0.45  15

In [37]:
# 다시 인덱스 설정을 원래대로 바꾸고 싶으면? (index 컬럼이 다시 값 컬럼으로)
df = df.reset_index('연도')
df

     연도   미국    한국  중국
0  2000  2.1  0.40  10
1  2010  2.2  0.50  13
2  2020  2.3  0.45  15

### 2. pandas 데이터 타입
- pandas 데이터 타입은 파이썬과 다르다. 
  - dtype 으로 불린다. 
  - 주요 데이터 타입
    - object 는 파이썬의 str 또는 혼용 데이터 타입 (문자열)
    - int64 는 파이썬의 int (정수)
    - float64 는 파이썬의 float (부동소숫점)
    - bool 는 파이썬의 bool (True 또는 False 값을 가지는 boolean)
    - 이외에 datetime64 (날짜/시간), timedelta[ns] (두 datatime64 간의 차) 도 활용된다.

In [40]:
s1 = pd.Series(['kang', 'oh', 'hong'])
s1

0    kang
1      oh
2    hong
dtype: object

In [39]:
s2 = pd.Series([1,1,2,3])
s2

0    1
1    1
2    2
3    3
dtype: int64

#### 데이터 타입 변경: Series.astype(변경할타입)

In [41]:
s2.astype('float')

0    1.0
1    1.0
2    2.0
3    3.0
dtype: float64

In [42]:
s3 = pd.Series(['kim', 1, 1.2, True]) #값들이 중복 => 오브젝트 타입.
s3

0     kim
1       1
2     1.2
3    True
dtype: object

In [43]:
s3 = pd.Series([True, False]) #boolean으로만 된다면?
s3

0     True
1    False
dtype: bool

In [44]:
student_df

    이름  나이            주소
0  강경미  30  경기도 고양시 일산동구
1  고길동  20   서울시 노원구 상계동
2  개나리  19   서울시 강남구 역삼동

In [45]:
student_df['나이']

0    30
1    20
2    19
Name: 나이, dtype: int64

In [46]:
student_df['이름']

0    강경미
1    고길동
2    개나리
Name: 이름, dtype: object

In [47]:
student_df.to_csv('student_list.txt', na_rep ='_' ) #na_rep = '구분자'

In [48]:
student_df.to_csv('student_list_no.txt', index = False, header = False, na_rep = '_')

##### DB에서 데이터 꺼내오기

In [51]:
import cx_Oracle
myconn = cx_Oracle.connect('hr', 'hr', '127.0.0.1:1521/xe')

In [53]:
query = 'select * from departments'

df_dept = pd.read_sql(query, con = myconn)  #접속정보.
myconn.close()

In [55]:
df_dept.head()

   DEPARTMENT_ID  DEPARTMENT_NAME  MANAGER_ID  LOCATION_ID
0             10   Administration       200.0         1700
1             20        Marketing       201.0         1800
2             30       Purchasing       114.0         1700
3             40  Human Resources       203.0         2400
4             50         Shipping       121.0         1500

In [57]:
df_dept.to_csv('dept.csv', encoding = 'utf-8-sig')

#### dataframe 데이터 파악하기
 - shape 속성 : 행렬의 크기를 알려준다.
 - describe 함수 : 숫자형 데이터의 통계치를 계산한다.
 - info 함수 : 데이터 타입, 각 아이템의 개수 등 출력한다.

In [59]:
df_dept.shape

(27, 4)

In [60]:
df_dept.describe()

       DEPARTMENT_ID  MANAGER_ID  LOCATION_ID
count      27.000000   11.000000    27.000000
mean      140.000000  154.909091  1777.777778
std        79.372539   47.139059   284.650033
min        10.000000  100.000000  1400.000000
25%        75.000000  111.000000  1700.000000
50%       140.000000  145.000000  1700.000000
75%       205.000000  202.000000  1700.000000
max       270.000000  205.000000  2700.000000

In [61]:
df_dept.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 27 entries, 0 to 26
Data columns (total 4 columns):
DEPARTMENT_ID      27 non-null int64
DEPARTMENT_NAME    27 non-null object
MANAGER_ID         11 non-null float64
LOCATION_ID        27 non-null int64
dtypes: float64(1), int64(2), object(1)
memory usage: 992.0+ bytes

#### describe 각종 통계량을 요약해서 출력
- 통계량은 sERIES에 대해 요약이 수행된다.
- DataFrame의 경우 열에 대해 요약이 수행된다.
- 기본적으로 누락 데이터(NaN)는 제외하고 데이터 요약이 수행된다. 

- 매개변수 percentiles: 분위수를 출력하기 위한 데이터를 입력받는다. 
-include: 결과를 요약하기 위한 데이터 타입의 리스트를 입력 받는다. 

참고 : https://kongdols-room.tistory.com/172

In [67]:
df_dept.describe(percentiles =[0.75] )

       DEPARTMENT_ID  MANAGER_ID  LOCATION_ID
count      27.000000   11.000000    27.000000
mean      140.000000  154.909091  1777.777778
std        79.372539   47.139059   284.650033
min        10.000000  100.000000  1400.000000
50%       140.000000  145.000000  1700.000000
75%       205.000000  202.000000  1700.000000
max       270.000000  205.000000  2700.000000

In [65]:
df_dept.describe(include = ['object'])

       DEPARTMENT_NAME
count               27
unique              27
top        IT Helpdesk
freq                 1

In [66]:
df_dept.describe(include = 'all')

        DEPARTMENT_ID DEPARTMENT_NAME  MANAGER_ID  LOCATION_ID
count       27.000000              27   11.000000    27.000000
unique            NaN              27         NaN          NaN
top               NaN     IT Helpdesk         NaN          NaN
freq              NaN               1         NaN          NaN
mean       140.000000             NaN  154.909091  1777.777778
std         79.372539             NaN   47.139059   284.650033
min         10.000000             NaN  100.000000  1400.000000
25%         75.000000             NaN  111.000000  1700.000000
50%        140.000000             NaN  145.000000  1700.000000
75%        205.000000             NaN  202.000000  1700.000000
max        270.000000             NaN  205.000000  2700.000000

#### 인덱스 
 - index 속성
 - 각 아이템을 특정할 수 있는 고유의 값을 저장한다.
 - 복잡한 데이터의 경우, 멀티 인덱스로 표현 가능하다.

In [70]:
df_dept.columns

Index(['DEPARTMENT_ID', 'DEPARTMENT_NAME', 'MANAGER_ID', 'LOCATION_ID'], dtype='object')

In [77]:
df_dept['LOCATION_ID']

0     1700
1     1800
2     1700
3     2400
4     1500
5     1400
6     2700
7     2500
8     1700
9     1700
10    1700
11    1700
12    1700
13    1700
14    1700
15    1700
16    1700
17    1700
18    1700
19    1700
20    1700
21    1700
22    1700
23    1700
24    1700
25    1700
26    1700
Name: LOCATION_ID, dtype: int64

#### 컬럼(column)
 - columns 속성
 - 각각의 특성(feature)을 나타냄
 - 복잡한 데이터의 경우, 멀티 컬럼으로 표현 가능

In [71]:
df_dept.columns

Index(['DEPARTMENT_ID', 'DEPARTMENT_NAME', 'MANAGER_ID', 'LOCATION_ID'], dtype='object')

#### 원하는 컬럼만 선택하기.

In [74]:
df_dept['DEPARTMENT_NAME']

0           Administration
1                Marketing
2               Purchasing
3          Human Resources
4                 Shipping
5                       IT
6         Public Relations
7                    Sales
8                Executive
9                  Finance
10              Accounting
11                Treasury
12           Corporate Tax
13      Control And Credit
14    Shareholder Services
15                Benefits
16           Manufacturing
17            Construction
18             Contracting
19              Operations
20              IT Support
21                     NOC
22             IT Helpdesk
23        Government Sales
24            Retail Sales
25              Recruiting
26                 Payroll
Name: DEPARTMENT_NAME, dtype: object

In [75]:
df_dept['DEPARTMENT_NAME'].head()

0     Administration
1          Marketing
2         Purchasing
3    Human Resources
4           Shipping
Name: DEPARTMENT_NAME, dtype: object

In [76]:
df_dept[['DEPARTMENT_NAME', 'LOCATION_ID']].head()

   DEPARTMENT_NAME  LOCATION_ID
0   Administration         1700
1        Marketing         1800
2       Purchasing         1700
3  Human Resources         2400
4         Shipping         1500

#### 원하는 row만 선택하기!! 
  - dataframe의 경우 기본적으로  **[]** 연산자가column 선택에 사용된다.
  - 하지만, slicing은 row 레벨로 지원

In [78]:
df_dept[1:4]

   DEPARTMENT_ID  DEPARTMENT_NAME  MANAGER_ID  LOCATION_ID
1             20        Marketing       201.0         1800
2             30       Purchasing       114.0         1700
3             40  Human Resources       203.0         2400

#### row 선택하기
  - Seires의 경우 []로 row 선택이 가능하다.
  - DataFrame의 경우는 **기본적으로 column**을 선택하도록 설계되어있다.
  - 그러므로, **.loc, .iloc**로 row 선택 한다.
    - 데이터프레임.loc : index 를 통해서 값을 찾음
    - 데이터프레임.iloc : 인덱스 번호를 통해서 값을 찾음 (0부터 시작)
    - 이 두 함수는 ,를 사용하여 column 선택도 가능하다.

In [79]:
df_dept.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 27 entries, 0 to 26
Data columns (total 4 columns):
DEPARTMENT_ID      27 non-null int64
DEPARTMENT_NAME    27 non-null object
MANAGER_ID         11 non-null float64
LOCATION_ID        27 non-null int64
dtypes: float64(1), int64(2), object(1)
memory usage: 992.0+ bytes

In [80]:
import numpy as np

In [81]:
df_dept.index = np.arange(100, 127)
df_dept

     DEPARTMENT_ID       DEPARTMENT_NAME  MANAGER_ID  LOCATION_ID
100             10        Administration       200.0         1700
101             20             Marketing       201.0         1800
102             30            Purchasing       114.0         1700
103             40       Human Resources       203.0         2400
104             50              Shipping       121.0         1500
105             60                    IT       103.0         1400
106             70      Public Relations       204.0         2700
107             80                 Sales       145.0         2500
108             90             Executive       100.0         1700
109            100               Finance       108.0         1700
110            110            Accounting       205.0         1700
111            120              Treasury         NaN         1700
112            130         Corporate Tax         NaN         1700
113            140    Control And Credit         NaN         1700
114            150  Shareholder Services         NaN         1700
115            160              Benefits         NaN         1700
116            170         Manufacturing         NaN         1700
117            180          Construction         NaN         1700
118            190           Contracting         NaN         1700
119            200            Operations         NaN         1700
120            210            IT Support         NaN         1700
121            220                   NOC         NaN         1700
122            230           IT Helpdesk         NaN         1700
123            240      Government Sales         NaN         1700
124            250          Retail Sales         NaN         1700
125            260            Recruiting         NaN         1700
126            270               Payroll         NaN         1700

#### row, column 동시에 선택하기
 - loc, iloc 속성을 이용할 때, 콤마를 이용하여 둘 다 명시 가능

In [82]:
df_dept[100] #컬럼을 기준으로 기본으로 하기때문에...안됨!

KeyError: 100

In [83]:
df_dept.loc[100]

DEPARTMENT_ID                  10
DEPARTMENT_NAME    Administration
MANAGER_ID                    200
LOCATION_ID                  1700
Name: 100, dtype: object

In [84]:
df_dept.loc[[100, 110, 120]]  #여러 행의 index 가져올때

     DEPARTMENT_ID DEPARTMENT_NAME  MANAGER_ID  LOCATION_ID
100             10  Administration       200.0         1700
110            110      Accounting       205.0         1700
120            210      IT Support         NaN         1700

In [85]:
df_dept.iloc[[1, 11, 12]]  #인덱스 순서번호 기준으로 불러옴.

     DEPARTMENT_ID DEPARTMENT_NAME  MANAGER_ID  LOCATION_ID
101             20       Marketing       201.0         1800
111            120        Treasury         NaN         1700
112            130   Corporate Tax         NaN         1700

In [86]:
#row 인덱스가 100, 110, 120이고 컬럼은 department_id = department_name만 보고싶다
df_dept.loc[[100, 110, 120], ['DEPARTMENT_ID', 'DEPARTMENT_NAME']]

     DEPARTMENT_ID DEPARTMENT_NAME
100             10  Administration
110            110      Accounting
120            210      IT Support

In [89]:
df_dept.iloc[[1, 11, 12], [0, 2]]

     DEPARTMENT_ID  MANAGER_ID
101             20       201.0
111            120         NaN
112            130         NaN

### 연습문제
- student.csv 파일을 dataframe으로 읽어온다.
- rows는 모두 보여주고, 컬럼은 이름, 나이만 출력

In [90]:
df = pd.read_csv('student.csv')
df[['이름', '나이']]

    이름  나이
0  오혜인  20
1  강경미  20
2  홍길동  10

In [91]:
df.loc[:, ['이름', '나이']]

    이름  나이
0  오혜인  20
1  강경미  20
2  홍길동  10

In [92]:
df.iloc[:,0:2]

    이름  나이
0  오혜인  20
1  강경미  20
2  홍길동  10